chenlongchoo/EM6300/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_dsPIC33E_SK_8PMP.h
        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISCCLR = _TRISC_TRISC2_MASK
        #define DisplaySetCommand()         LATCCLR = _LATC_LATC2_MASK
        #define DisplaySetData()            LATCSET = _LATC_LATC2_MASK

        // Definitions for CS pin
        #define DisplayConfig()             TRISDCLR = _TRISD_TRISD10_MASK
        #define DisplayEnable()             LATDCLR = _LATD_LATD10_MASK
        #define DisplayDisable()            LATDSET = _LATD_LATD10_MASK

        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()          
        #define DisplayFlashEnable()        
        #define DisplayFlashDisable()       

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()        
        #define DisplayPowerOn()            
        #define DisplayPowerOff()            
        
        // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)  
        #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)   

    #elif defined (__PIC24F__) || defined (__dsPIC33E__) || defined (__PIC24E__)
        /* When using the supported PIC24F devices
            PIC24FJ128GA010
            PIC24FJ256GA110
            PIC24FJ256GB110
            PIC24FJ256GB210
           NOTE: PIC24FJ256DA210 is not on the list since
                 this part has a built in display controller
                 and it directly interfaces to the display 
                 panel.
        */
        
        // Definitions for reset pin
        #define DisplayResetConfig()        TRISCbits.TRISC1 = 0    
        #define DisplayResetEnable()        LATCbits.LATC1 = 0
        #define DisplayResetDisable()       LATCbits.LATC1 = 1

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISCbits.TRISC2 = 0
        #define DisplaySetCommand()         LATCbits.LATC2 = 0
        #define DisplaySetData()            LATCbits.LATC2 = 1

        // Definitions for CS pin
        #define DisplayConfig()             TRISDbits.TRISD10 = 0             
        #define DisplayEnable()             LATDbits.LATD10 = 0
        #define DisplayDisable()            LATDbits.LATD10 = 1

        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()         
        #define DisplayFlashEnable()        
        #define DisplayFlashDisable()       

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()        
        #define DisplayPowerOn()            
        #define DisplayPowerOff()           
        
        // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)  
        #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)   
        

    #else
    
        #error "Selected Device is not supported"
        
    #endif

// end of #if defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E) || defined(GFX_PICTAIL_LCC)   

// -----------------------------------
// When using MultiMedia Expansion Board
// -----------------------------------
/*
    This development board will be compatible with:
    1. PIC32 Starter Kits
       - PIC32 Starter Kit (DM320001)
       - PIC32 USB Starter Kit II (DM320003-2)
       - PIC32 Ethernet Starter Kit (DM320004)
*/

#elif defined (MEB_BOARD)
	
	#if defined(__dsPIC33E__) || defined(__PIC24E__)
		
		#define DisplayResetConfig()        ANSELAbits.ANSA10 = 0; TRISAbits.TRISA10 = 0    
        #define DisplayResetEnable()        LATAbits.LATA10 = 0 
        #define DisplayResetDisable()       LATAbits.LATA10 = 1

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      ANSELBbits.ANSB10 = 0; TRISBbits.TRISB10 = 0
        #define DisplaySetCommand()         LATBbits.LATB10 = 0
        #define DisplaySetData()            LATBbits.LATB10 = 1

        // Definitions for CS pin
        #define DisplayConfig()             TRISGbits.TRISG13 = 0             
        #define DisplayEnable()             LATGbits.LATG13 = 0
        #define DisplayDisable()            LATGbits.LATG13 = 1

        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()         
        #define DisplayFlashEnable()        
        #define DisplayFlashDisable()       

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()        
        #define DisplayPowerOn()            
        #define DisplayPowerOff()  
        
         // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)  
        #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)    
        
    #else
	     /********
	     * PIC32 will use the SET and CLR SFRs for the I/O.
	     * These are atomic settings that are recommended when
	     * modifying SFRs
	     ********/
	     // Definitions for reset pin
	     #define DisplayResetConfig()           TRISACLR = _TRISA_TRISA10_MASK    
	     #define DisplayResetEnable()           LATACLR = _LATA_LATA10_MASK
	     #define DisplayResetDisable()          LATASET = _LATA_LATA10_MASK
	
	     // Definitions for RS pin
	     #define DisplayCmdDataConfig()         AD1PCFGSET = _AD1PCFG_PCFG10_MASK, TRISBCLR = _TRISB_TRISB10_MASK
	     #define DisplaySetCommand()            LATBCLR = _LATB_LATB10_MASK
	     #define DisplaySetData()               LATBSET = _LATB_LATB10_MASK
	
	     // Definitions for CS pin
	     #define DisplayConfig()                TRISGCLR = _TRISG_TRISG13_MASK
	     #define DisplayEnable()                LATGCLR = _LATG_LATG13_MASK
	     #define DisplayDisable()               LATGSET = _LATG_LATG13_MASK
	
	     // Definitions for FLASH CS pin
	     #define DisplayFlashConfig()          
	     #define DisplayFlashEnable()        
	     #define DisplayFlashDisable()       
	
