chenlongchoo/EM6300/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_dsPIC33E_SK_8PMP.h
	     // Definitions for POWER ON pin
	     #define DisplayPowerConfig()        
	     #define DisplayPowerOn()            
	     #define DisplayPowerOff()           
	
	    #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)  
	    #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
	    #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)   
	    
	#endif
    
// end of #elif defined (MEB_BOARD)

// -----------------------------------
// When using PIC24FJ256DA210 Development Board
// -----------------------------------
/*
    This development board only has PIC24FJ256DA210 device.
*/

#elif defined (PIC24FJ256DA210_DEV_BOARD)
	
    // Definitions for POWER ON pin
    #define DisplayPowerConfig()            TRISAbits.TRISA5 = 0       
    #define DisplayPowerOn()                LATAbits.LATA5 = 1           
    #define DisplayPowerOff()               LATAbits.LATA5 = 0

    // Definitions for backlight control pin
    #define DisplayBacklightConfig()        
    #define DisplayBacklightOn()        
    #define DisplayBacklightOff()          
    
    // Dummy definitions
    // Definitions for reset pin
    #define DisplayResetConfig()           
    #define DisplayResetEnable()           
    #define DisplayResetDisable()          

    // Definitions for RS pin
    #define DisplayCmdDataConfig()         
    #define DisplaySetCommand()            
    #define DisplaySetData()               

    // Definitions for CS pin
    #define DisplayConfig()                
    #define DisplayEnable()                
    #define DisplayDisable()               
    

// end of #elif defined (PIC24FJ256DA210_DEV_BOARD)

// -----------------------------------
// When using GFX_PICTAIL_V2
// -----------------------------------
/*
    This development board is obsolete and is
    not recommended to be used in new designs.
    Compatible with Explorer 16 (EXPLORER_16)
*/

#elif defined (GFX_PICTAIL_V2)

    #if defined (GFX_USE_DISPLAY_CONTROLLER_LGDP4531)

        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)

            // Definitions for reset pin
            #define DisplayResetConfig()        TRISAbits.TRISA4 = 0    
            #define DisplayResetEnable()        LATAbits.LATA4 = 0
            #define DisplayResetDisable()       LATAbits.LATA4 = 1

            // Definitions for RS pin
            #define DisplayCmdDataConfig()      TRISAbits.TRISA1 = 0
            #define DisplaySetCommand()         LATAbits.LATA1 = 0
            #define DisplaySetData()            LATAbits.LATA1 = 1

            // Definitions for CS pin
            #define DisplayConfig()             TRISBbits.TRISB15 = 0             
            #define DisplayEnable()             LATBbits.LATB15 = 0
            #define DisplayDisable()            LATBbits.LATB15 = 1

            // Definitions for POWER ON pin
            #define DisplayPowerConfig()        TRISAbits.TRISA10 = 0
            #define DisplayPowerOn()            LATAbits.LATA10 = 0
            #define DisplayPowerOff()           LATAbits.LATA10 = 1

            #define DisplayBacklightConfig()     
            #define DisplayBacklightOn()        
            #define DisplayBacklightOff()       

            // Definitions for FLASH CS pin
            #define DisplayFlashConfig()        TRISAbits.TRISA8 = 0        
            #define DisplayFlashEnable()        LATAbits.LATA8 = 1
            #define DisplayFlashDisable()       LATAbits.LATA8 = 0

        #elif defined (__PIC32MX__)

            /********
             * PIC32 will use the SET and CLR SFRs for the I/O.
             * These are atomic settings that are recommended when
             * modifying SFRs
             ********/
	            // Definitions for reset pin
            #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK    
            #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
            #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

	            // Definitions for RS pin
            #define DisplayCmdDataConfig()      TRISCCLR = _TRISC_TRISC2_MASK
            #define DisplaySetCommand()         LATCCLR = _LATC_LATC2_MASK
            #define DisplaySetData()            LATCSET = _LATC_LATC2_MASK

	            // Definitions for CS pin
            #define DisplayConfig()             TRISDCLR = _TRISD_TRISD10_MASK
            #define DisplayEnable()             LATDCLR = _LATD_LATD10_MASK
            #define DisplayDisable()            LATDSET = _LATD_LATD10_MASK

            // Definitions for POWER ON pin
            #define DisplayPowerConfig()        TRISCCLR = _TRISC_TRISC3_MASK
            #define DisplayPowerOn()            LATCCLR = _LATC_LATC3_MASK 
            #define DisplayPowerOff()           LATCSET = _LATC_LATC3_MASK

            #define DisplayBacklightConfig()     
            #define DisplayBacklightOn()        
            #define DisplayBacklightOff()       

            // Definitions for FLASH CS pin
            #define DisplayFlashConfig()        TRISDCLR = _TRISD_TRISD1_MASK     
            #define DisplayFlashEnable()        LATDCLR = _LATD_LATD1_MASK
            #define DisplayFlashDisable()       LATDSET = _LATD_LATD1_MASK

        #elif defined (__PIC24F__)
    	    // Definitions for reset pin
            #define DisplayResetConfig()        TRISCbits.TRISC1 = 0    
            #define DisplayResetEnable()        LATCbits.LATC1 = 0
            #define DisplayResetDisable()       LATCbits.LATC1 = 1

	        // Definitions for RS pin
            #define DisplayCmdDataConfig()      TRISCbits.TRISC2 = 0
            #define DisplaySetCommand()         LATCbits.LATC2 = 0
            #define DisplaySetData()            LATCbits.LATC2 = 1

	        // Definitions for CS pin
            #define DisplayConfig()             TRISDbits.TRISD10 = 0             
            #define DisplayEnable()             LATDbits.LATD10 = 0
            #define DisplayDisable()            LATDbits.LATD10 = 1

