chenlongchoo/EM6300/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_dsPIC33E_SK_8PMP.h
            // Definitions for POWER ON pin
            #define DisplayPowerConfig()        TRISCbits.TRISC3 = 0
            #define DisplayPowerOn()            LATCbits.LATC3 = 0
            #define DisplayPowerOff()           LATCbits.LATC3 = 1

            #define DisplayBacklightConfig()     
            #define DisplayBacklightOn()        
            #define DisplayBacklightOff()       

            // Definitions for FLASH CS pin
            #define DisplayFlashConfig()        TRISDbits.TRISD1 = 0        
            #define DisplayFlashEnable()        LATDbits.LATD1 = 1
            #define DisplayFlashDisable()       LATDbits.LATD1 = 0

        #endif

    // end of #if defined (GFX_USE_DISPLAY_CONTROLLER_LGDP4531)

    #elif defined (GFX_USE_DISPLAY_CONTROLLER_SSD1906)

            #ifndef __PIC32MX__
	            // Definitions for reset pin
                #define DisplayResetConfig()        TRISCbits.TRISC1 = 0    
                #define DisplayResetEnable()        LATCbits.LATC1 = 0
                #define DisplayResetDisable()       LATCbits.LATC1 = 1

	            // Definitions for RS pin
                #define DisplayCmdDataConfig()      TRISCbits.TRISC2 = 0
                #define DisplaySetCommand()         LATCbits.LATC2 = 0
                #define DisplaySetData()            LATCbits.LATC2 = 1

	            // Definitions for CS pin
                #define DisplayConfig()             TRISDbits.TRISD10 = 0             
                #define DisplayEnable()             LATDbits.LATD10 = 0
                #define DisplayDisable()            LATDbits.LATD10 = 1

                // Definitions for POWER ON pin
                #define DisplayPowerConfig()        TRISCbits.TRISC3 = 0
                #define DisplayPowerOn()            LATCbits.LATC3 = 1
                #define DisplayPowerOff()           LATCbits.LATC3 = 0

                // Extended address lines
                #define DisplayAddr0Config()        TRISDbits.TRISD3 = 0
                #define DisplaySetAddr0()           LATDbits.LATD3 = 1
                #define DisplayClearAddr0()         LATDbits.LATD3 = 0

                #define DisplayAddr17Config()       TRISGbits.TRISG14 = 0
                #define DisplaytSetAddr17()         TRISGbits.TRISG14 = 1
                #define DisplayClearAddr17()        TRISGbits.TRISG14 = 0

                // Definitions for FLASH CS pin
                #define DisplayFlashConfig()        TRISDbits.TRISD1 = 0        
                #define DisplayFlashEnable()        LATDbits.LATD1 = 1
                #define DisplayFlashDisable()       LATDbits.LATD1 = 0

            #else
            /********
             * PIC32 will use the SET and CLR SFRs for the I/O.
             * These are atomic settings that are recommended when
             * modifying SFRs
             ********/
	            // Definitions for reset pin
                #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK    
                #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
                #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

	            // Definitions for RS pin
                #define DisplayCmdDataConfig()      TRISCCLR = _TRISC_TRISC2_MASK
                #define DisplaySetCommand()         LATCCLR = _LATC_LATC2_MASK
                #define DisplaySetData()            LATCSET = _LATC_LATC2_MASK

	            // Definitions for CS pin
                #define DisplayConfig()             TRISDCLR = _TRISD_TRISD10_MASK
                #define DisplayEnable()             LATDCLR = _LATD_LATD10_MASK
                #define DisplayDisable()            LATDSET = _LATD_LATD10_MASK

                // Definitions for POWER ON pin
                #define DisplayPowerConfig()        TRISCCLR = _TRISC_TRISC3_MASK
                #define DisplayPowerOn()            LATCSET = _LATC_LATC3_MASK 
                #define DisplayPowerOff()           LATCCLR = _LATC_LATC3_MASK

                // Extended address lines
                #define DisplayAddr0Config()        TRISDCLR = _TRISD_TRISD3_MASK
                #define DisplaySetAddr0()           LATDCLR = _LATD_LATD3_MASK
                #define DisplayClearAddr0()         LATDSET = _LATD_LATD3_MASK

                #define DisplayAddr17Config()       TRISGCLR = _TRISD_TRISG14_MASK
                #define DisplaytSetAddr17()         LATGCLR = _LATD_LATG14_MASK
                #define DisplayClearAddr17()        LATGSET = _LATD_LATG14_MASK

                // Definitions for FLASH CS pin
                #define DisplayFlashConfig()        TRISDCLR = _TRISD_TRISD1_MASK     
                #define DisplayFlashEnable()        LATDCLR = _LATD_LATD1_MASK
                #define DisplayFlashDisable()       LATDSET = _LATD_LATD1_MASK

            #endif
    // end of #elif defined (GFX_USE_DISPLAY_CONTROLLER_SSD1906)        
    #endif

// end of #elif defined (GFX_PICTAIL_V2)

// -----------------------------------
// When using MIKRO_BOARD
// -----------------------------------
/*
    This development board family currently supports:
    - Mikromedia Board for PIC24 (TMIK010)
*/

#elif defined (MIKRO_BOARD)
	#if defined(__PIC24FJ256GB110__)
    // Definitions for reset pin
    #define DisplayResetConfig()        TRISCbits.TRISC1 = 0    
    #define DisplayResetEnable()        LATCbits.LATC1 = 0
    #define DisplayResetDisable()       LATCbits.LATC1 = 1

    // Definitions for RS pin
    #define DisplayCmdDataConfig()      TRISBbits.TRISB15 = 0
    #define DisplaySetCommand()         LATBbits.LATB15 = 0
    #define DisplaySetData()            LATBbits.LATB15 = 1

    // Definitions for CS pin
    #define DisplayConfig()             TRISFbits.TRISF12 = 0             
    #define DisplayEnable()             LATFbits.LATF12 = 0
    #define DisplayDisable()            LATFbits.LATF12 = 1


    // Definitions for FLASH CS pin
    #define DisplayFlashConfig()       
    #define DisplayFlashEnable()       
    #define DisplayFlashDisable()      

