chenlongchoo/EM6300/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_dsPIC33E_SK_8PMP.h
    // Definitions for POWER ON pin
    #define DisplayPowerConfig()       
    #define DisplayPowerOn()           
    #define DisplayPowerOff()          

    // Definitions for backlight control pin
    #define DisplayBacklightConfig()      
    #define DisplayBacklightOn()        
    #define DisplayBacklightOff()      
	#endif
// end of #elif defined (MIKRO_BOARD)

#endif 

/*********************************************************************
* HARDWARE PROFILE FOR THE RESISTIVE TOUCHSCREEN 
*********************************************************************/
/*
	These are the hardware settings for the 4-wire resistive
	touch screen. There are two analog inputs and two digital I/Os
	needed. 
	
	This portion is divided into 3 components
	1. IO and ADC channels settings - sets up the IO pins used and the
	   ADC channel selected to evaluate the screen touch. 
	2. Touch Screen X and Y orientation settings - sets up the
	   x and y directions. This is dependent on how the resistive
	   touch signals (X-, Y-, X+, and Y+) are wired up to the 
	   IOs and ADC signals with respect to the orientation of the
	   screen. Based on these factors, we can control the calculation
	   of the touch by swapping x and/or y and flipping the x and/or y 
	   directions.
	3. Touch Screen Non-Volatile Memory Storage Macros - this defines
	   the non-volatile memory read, write and sector erase functions
	   to be used when reading or storing calibration values.    
	
	The resistive touch screen driver assumes the following: 
	1. X+ and Y+ are mapped to the A/D inputs
	2. X- and Y- are mapped to the pure digital I/Os
*/

#if defined (USE_TOUCHSCREEN_RESISTIVE)

	/*********************************************************************
	* Resistive Touch Screen A/D and I/O Specific Macros 
	*********************************************************************/
	// ADC Input Channel Selector
	#if defined(__dsPIC33F__) || defined(__PIC24H__) || defined(__dsPIC33E__) || defined(__PIC24E__)
		#define TOUCH_ADC_INPUT_SEL   AD1CHS0
    #else // all other supported devices
		#define TOUCH_ADC_INPUT_SEL   AD1CHS
    #endif

	// ADC Sample Start 
	#define TOUCH_ADC_START   AD1CON1bits.SAMP 

	// ADC Status
	#define TOUCH_ADC_DONE   AD1CON1bits.DONE

	// Hardware Platform dependend macros
	/* ----------------------------------------- */
	#if defined (PIC24FJ256DA210_DEV_BOARD)
	/* ----------------------------------------- */
		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* PIC24FJ256DA210 Development Board does 
		 * not have a temperature sensor 
		 */
		#define ADC_POT			5
		#define ADC_XPOS		16
		#define ADC_YPOS		18

		// ADC Port Control Bits
		#define ADC_POT_PCFG	ANSBbits.ANSB5
		#define ADPCFG_XPOS		ANSCbits.ANSC4
		#define ADPCFG_YPOS		ANSGbits.ANSG7

		// Y port definitions
		#define LAT_XPOS    LATCbits.LATC4
		#define TRIS_XPOS   TRISCbits.TRISC4
		#define LAT_XNEG    LATAbits.LATA2
		#define TRIS_XNEG   TRISAbits.TRISA2
	     
		// X port definitions
		#define LAT_YPOS    LATGbits.LATG7
		#define TRIS_YPOS   TRISGbits.TRISG7
   		#define LAT_YNEG    LATAbits.LATA1
		#define TRIS_YNEG   TRISAbits.TRISA1
    
    // end of #if defined (PIC24FJ256DA210_DEV_BOARD)...
    
	/* ----------------------------------------- */
	#elif defined (MEB_BOARD)
	/* ----------------------------------------- */
	
		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* The Multi-Media Expansion Board does not have a
		 * analog pot or temperature sensor (see BMA150 for temperature
		 * sensor data
		 */
		#if defined(__dsPIC33E__) || defined(__PIC24E__)
		
			#define ADC_XPOS    11
			#define ADC_YPOS    14
		
			// X port definitions
			#define LAT_XPOS    LATBbits.LATB11
			#define TRIS_XPOS   TRISBbits.TRISB11
			#define LAT_XNEG    LATBbits.LATB13
			#define TRIS_XNEG   ANSELBbits.ANSB13 = 1, TRISBbits.TRISB13
		
			// Y port definitions
			#define LAT_YPOS    LATBbits.LATB14
			#define TRIS_YPOS   TRISBbits.TRISB14
			#define LAT_YNEG    LATBbits.LATB12 
			#define TRIS_YNEG   ANSELBbits.ANSB12 = 1, TRISBbits.TRISB12
		
		
		#else

		
			#define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN11
			#define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN14
	
			// ADC Port Control Bits
			#define ADPCFG_XPOS AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS AD1PCFGbits.PCFG14
			
			// X port definitions
			#define LAT_XPOS    LATBbits.LATB11
			#define TRIS_XPOS   TRISBbits.TRISB11
			#define LAT_XNEG    LATBbits.LATB13
			#define TRIS_XNEG   AD1PCFGbits.PCFG13 = 1, TRISBbits.TRISB13
	
			// Y port definitions
			#define LAT_YPOS    LATBbits.LATB14
			#define TRIS_YPOS   TRISBbits.TRISB14
			#define LAT_YNEG    LATBbits.LATB12 
			#define TRIS_YNEG   AD1PCFGbits.PCFG12 = 1, TRISBbits.TRISB12
		
		#endif // defined(__dsPIC33E__) || defined(__PIC24E__)

    // end of #elif defined (MEB_BOARD)...

	/* ----------------------------------------- */
	#elif defined (GFX_PICTAIL_LCC)
	/* ----------------------------------------- */

		// ADC channel constants
		// Potentiometer and Temperature sensor
		/* The GFX PICtail LCC Board does not have a
		 * analog pot or temperature sensor (see BMA150 for temperature
		 * sensor data
		 */
		#define ADC_XPOS    ADC_CH0_POS_SAMPLEA_AN0
		#define ADC_YPOS    ADC_CH0_POS_SAMPLEA_AN1

		// ADC Port Control Bits
        #define ADPCFG_XPOS AD1PCFGbits.PCFG0
        #define ADPCFG_YPOS AD1PCFGbits.PCFG1
		
		// X port definitions
        #define LAT_XPOS    LATBbits.LATB0
        #define TRIS_XPOS   TRISBbits.TRISB0

        #if defined(_USB) && !defined (PIC32_SK)
            #define LAT_XNEG    LATGbits.LATG15
            #define TRIS_XNEG   TRISGbits.TRISG15
        #else
            #define LAT_XNEG    LATDbits.LATD9
            #define TRIS_XNEG   TRISDbits.TRISD9
        #endif

		// Y port definitions

        #define LAT_YPOS    LATBbits.LATB1
        #define TRIS_YPOS   TRISBbits.TRISB1
        #define LAT_YNEG    LATBbits.LATB9
        #define TRIS_YNEG   TRISBbits.TRISB9

    // end of #elif defined (GFX_PICTAIL_LCC)...    
    
	/* ----------------------------------------- */
	#elif defined (GFX_PICTAIL_V2) // && defined (EXPLORER_16)  
	/* ----------------------------------------- */
	// NOTE: GFX_PICTAIL_V2 can only be paired with Explorer 16

		#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP        4
			#define ADC_POT         0
			#define ADC_XPOS		5
			#define ADC_YPOS		4

			// ADC Port Control Bits
			#define ADC_POT_TRIS    TRISAbits.TRISA0
			#define ADC_POT_PCFG    AD1PCFGLbits.PCFG0
			#define ADPCFG_XPOS		AD1PCFGLbits.PCFG5
			#define ADPCFG_YPOS		AD1PCFGLbits.PCFG4

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB3
			#define TRIS_XPOS		TRISBbits.TRISB3
			#define LAT_XNEG		LATCbits.LATC9
			#define TRIS_XNEG		TRISCbits.TRISC9

			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB2
			#define TRIS_YPOS		TRISBbits.TRISB2
			#define LAT_YNEG		LATCbits.LATC8
			#define TRIS_YNEG		TRISCbits.TRISC8

		#elif defined(__PIC32MX__)

			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP		ADC_CH0_POS_SAMPLEA_AN4
			#define ADC_POT			ADC_CH0_POS_SAMPLEA_AN5
			#define ADC_XPOS		ADC_CH0_POS_SAMPLEA_AN11
			#define ADC_YPOS		ADC_CH0_POS_SAMPLEA_AN10

			// ADC Port Control Bits
			#define ADC_POT_PCFG    AD1PCFGbits.PCFG5
	        #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS		AD1PCFGbits.PCFG10

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB11
			#define TRIS_XPOS		TRISBbits.TRISB11
			#define LAT_XNEG		LATGbits.LATG13
			#define TRIS_XNEG		TRISGbits.TRISG13
			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB10
			#define TRIS_YPOS		TRISBbits.TRISB10
			#define LAT_YNEG		LATGbits.LATG12
			#define TRIS_YNEG		TRISGbits.TRISG12


