chenlongchoo/EM6300/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_dsPIC33E_SK_8PMP.h
		#else // all other supported PIC devices

			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP		4
			#define ADC_POT			5
			#define ADC_XPOS		11
			#define ADC_YPOS		10

			// ADC Port Control Bits
			#define ADC_POT_PCFG    AD1PCFGbits.PCFG5
	        #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS		AD1PCFGbits.PCFG10

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB11
			#define TRIS_XPOS		TRISBbits.TRISB11
			#define LAT_XNEG		LATGbits.LATG13
			#define TRIS_XNEG		TRISGbits.TRISG13
			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB10
			#define TRIS_YPOS		TRISBbits.TRISB10
			#define LAT_YNEG		LATGbits.LATG12
			#define TRIS_YNEG		TRISGbits.TRISG12

		#endif

    // end of #elif defined (GFX_PICTAIL_V2) ...
    
	/* ----------------------------------------- */
	#elif defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E)  // && defined (EXPLORER_16) || PIC32 Starter Kits 
	/* ----------------------------------------- */
	// NOTE: GFX_PICTAIL_V3 can be paired with Explorer 16 or with PIC32 Starter Kits
    
		#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
			// ADC channel constants
			// Potentiometer and Temperature sensor
			#define ADC_TEMP        4
			#define ADC_POT         0
			#define ADC_XPOS		5
			#define ADC_YPOS		4

			// ADC Port Control Bits
			#define ADC_POT_TRIS    TRISAbits.TRISA0
			#define ADC_POT_PCFG    AD1PCFGLbits.PCFG0
			#define ADPCFG_XPOS		AD1PCFGLbits.PCFG5
			#define ADPCFG_YPOS		AD1PCFGLbits.PCFG4

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB3
			#define TRIS_XPOS		TRISBbits.TRISB3
			#define LAT_XNEG		LATCbits.LATC9
			#define TRIS_XNEG		TRISCbits.TRISC9

			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB2
			#define TRIS_YPOS		TRISBbits.TRISB2
			#define LAT_YNEG		LATCbits.LATC8
			#define TRIS_YNEG		TRISCbits.TRISC8

		#elif defined(__PIC32MX__)

			// ADC channel constants
            // resistive touch X and Y voltage sensing
			#define ADC_XPOS		ADC_CH0_POS_SAMPLEA_AN11
			#define ADC_YPOS		ADC_CH0_POS_SAMPLEA_AN10

			// Potentiometer and Temperature sensor
			#define ADC_TEMP		ADC_CH0_POS_SAMPLEA_AN4
            #if !defined (PIC32_SK)
                // potentiometer is not present in PIC32 Starter Kits
                #define ADC_POT			ADC_CH0_POS_SAMPLEA_AN5
            #endif    

            
			// ADC Port Control Bits
            #if !defined (PIC32_SK)
                // potentiometer is not present in PIC32 Starter Kits
                #define ADC_POT_PCFG    AD1PCFGbits.PCFG5
            #endif    
	        #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
			#define ADPCFG_YPOS		AD1PCFGbits.PCFG10

			// X port definitions
			#define LAT_XPOS		LATBbits.LATB11
			#define TRIS_XPOS		TRISBbits.TRISB11

            #if defined(_USB) && !defined (PIC32_SK)
 				#define LAT_XNEG		LATGbits.LATG15
				#define TRIS_XNEG		TRISGbits.TRISG15
			#else  // other supported PIC 32 devices
				#define LAT_XNEG		LATDbits.LATD9
				#define TRIS_XNEG		TRISDbits.TRISD9
			#endif

			// Y port definitions
			#define LAT_YPOS		LATBbits.LATB10
			#define TRIS_YPOS		TRISBbits.TRISB10

            #if defined (GFX_PICTAIL_V3E) && defined(PIC32_SK)
                  #define LAT_YNEG		LATBbits.LATB15
            #define TRIS_YNEG		TRISBbits.TRISB15
                  #else
                #define LAT_YNEG		LATDbits.LATD8
                #define TRIS_YNEG		TRISDbits.TRISD8
            #endif
       
       #else	//#else defined (__PIC24F__) || defined(__dsPIC33E__) || defined(__PIC24E__)

			// ADC channel constants
			// Potentiometer and Temperature sensor
			#if defined(__PIC24F__)
			    #define ADC_TEMP        4
			    #define ADC_POT         5

			// ADC Port Control Bits
    		#if defined(__PIC24FJ256GB210__)
	        	#define ADC_POT_PCFG	ANSBbits.ANSB5
    		    #define ADPCFG_XPOS		ANSBbits.ANSB11
		        #define ADPCFG_YPOS		ANSBbits.ANSB10
            #else
        		#define ADC_POT_PCFG    AD1PCFGbits.PCFG5
    	        #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
    			#define ADPCFG_YPOS		AD1PCFGbits.PCFG10
            #endif
			#endif

			#define ADC_XPOS        11
			#define ADC_YPOS        10

            // X port definitions
			#define LAT_XPOS		LATBbits.LATB11
			#define TRIS_XPOS		TRISBbits.TRISB11
			#define LAT_XNEG		LATDbits.LATD9
			#define TRIS_XNEG		TRISDbits.TRISD9 
			
            // Y port definitions
			#define LAT_YPOS		LATBbits.LATB10
			#define TRIS_YPOS		TRISBbits.TRISB10
			#define LAT_YNEG		LATDbits.LATD8
			#define TRIS_YNEG		TRISDbits.TRISD8

		#endif

	#elif defined(MIKRO_BOARD)
	    #if defined(__PIC24FJ256GB110__)
            #define ADC_XPOS    13
            #define ADC_YPOS    12

	        // Y port definitions
            #define ADPCFG_XPOS AD1PCFGbits.PCFG13
            #define LAT_XPOS    LATBbits.LATB13
            #define TRIS_XPOS   TRISBbits.TRISB13
            #define LAT_XNEG    LATBbits.LATB11
            #define TRIS_XNEG   TRISBbits.TRISB11
 
        	// X port definitions
            #define ADPCFG_YPOS AD1PCFGbits.PCFG12
            #define LAT_YPOS    LATBbits.LATB12
            #define TRIS_YPOS   TRISBbits.TRISB12
	        #define LAT_YNEG    LATBbits.LATB10
            #define TRIS_YNEG   TRISBbits.TRISB10
		#endif
	#endif // end of #elif defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E) ...

	/*********************************************************************
	* Touch Screen X and Y orientation
	*********************************************************************/
	/*********************************************************************
	Description:
		The usage of the resistive touch screen will be affected 
		by the way the hardware is mapped to the A/D channels that
		samples the touch. Since resistive touch is basically a 
		measurement of X and Y coordinates the following are macros
		that can modify the touch algorithm when sampling the 
		touch.
		TOUCHSCREEN_RESISTIVE_FLIP_X - will flip the x direction. 	
		TOUCHSCREEN_RESISTIVE_FLIP_Y - will flip the y direction.
		TOUCHSCREEN_RESISTIVE_SWAP_XY - will swap the x and y sampling.
		
		As long as the (X-,Y-) and (X+,Y+) are used consistently,
		and connected properly in hardware, the macros above
		can provide options to the user to align the touch screen
		to the screen orientation.

