chenlongchoo/EM6300/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_dsPIC33E_SK_8PMP.h
    #if defined (MIKRO_BOARD)
		#if defined (__PIC24FJ256GB110__)
            #define SST25_CS_TRIS   TRISCbits.TRISC2
            #define SST25_CS_LAT    LATCbits.LATC2
            #define SST25_SCK_TRIS  TRISGbits.TRISG6
            #define SST25_SDO_TRIS  TRISGbits.TRISG8
            #define SST25_SDI_TRIS  TRISGbits.TRISG7
        #endif
    #endif

#endif // #if defined (USE_M25P80)

/*********************************************************************
* HARDWARE PROFILE FOR THE PARALLEL FLASH MEMORY
*********************************************************************/
/*
	These are the hardware settings for parallel flash 
	memory on GFX2 and PIC24FJ256DA210 Development Board 
*/	

#if defined (USE_SST39LF400)
    /* 
        Driver controls the parallel flash interface since it is connected to 
        EPMP in PIC24FJ256DA210 Development Board
    */   
#endif // #if defined (USE_SST39LF400)

#if defined (USE_SST39VF040)
    /* 
        When using GFX_PICTAIL_V2 
    */   
	#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__) 
		#define SST39_CS_TRIS    TRISAbits.TRISA8
		#define SST39_CS_LAT     LATAbits.LATA8
		#define SST39_A18_TRIS   TRISAbits.TRISA1
		#define SST39_A18_LAT    LATAbits.LATA1
		#define SST39_A17_TRIS   TRISCbits.TRISC5
		#define SST39_A17_LAT    LATCbits.LATC5
		#define SST39_A16_TRIS   TRISCbits.TRISC4
		#define SST39_A16_LAT    LATCbits.LATC4
	#else
		#define SST39_CS_TRIS    TRISDbits.TRISD1
		#define SST39_CS_LAT     LATDbits.LATD1
		#define SST39_A18_TRIS   TRISCbits.TRISC2
		#define SST39_A18_LAT    LATCbits.LATC2
		#define SST39_A17_TRIS   TRISGbits.TRISG15
		#define SST39_A17_LAT    LATGbits.LATG15
		#define SST39_A16_TRIS   TRISGbits.TRISG14
		#define SST39_A16_LAT    LATGbits.LATG14
	#endif

#endif // #if defined (USE_SST39VF040)


/*********************************************************************
* HARDWARE PROFILE FOR THE TIMING CONTROLLER
*********************************************************************/
/*
	Timing Controllers (TCON) are used by some displays.
	The display selected will determine the TCON that will be used
	in the build. 
	When using SSD1926, the TCON is connected through the SSD1926 
	GPIO and SPI transfers is BitBanged on these GPIO ports.
	Refer to SSD1926 implementation for details.
*/
	/*********************************************************************
	* I/Os for the TCON 
	*********************************************************************/

	/* ----------------------------------------- */
	#if defined (PIC24FJ256DA210_DEV_BOARD) 
		#if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
	/* ----------------------------------------- */
		
		#define TCON_CS_LAT      LATAbits.LATA0   //_RA0
		#define TCON_CS_TRIS     TRISAbits.TRISA0 //_TRISA0
		#define TCON_CS_DIG()
	    
		#define TCON_SCL_LAT     LATDbits.LATD8   //_RD8
		#define TCON_SCL_TRIS    TRISDbits.TRISD8 //_TRISD8
		#define TCON_SCL_DIG()
	    
		#define TCON_SDO_LAT     LATBbits.LATB1   //_RB1
		#define TCON_SDO_TRIS    TRISBbits.TRISB1 //_TRISB1
		#define TCON_SDO_DIG()   _ANSB1 = 0;
	    
		#define TCON_DC_LAT      LATBbits.LATB0   //_RB0
		#define TCON_DC_TRIS     TRISBbits.TRISB0 //_TRISB0
		#define TCON_DC_DIG()    _ANSB0 = 0;
		
		#endif // #if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
	#endif // #if defined (DA210_DEV_BOARD)...

	/* ----------------------------------------- */
	#if defined (GFX_PICTAIL_LCC) 
		#if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
	/* ----------------------------------------- */
		
		#define TCON_CS_LAT      LATCbits.LATC2   //_RA0
		#define TCON_CS_TRIS     TRISCbits.TRISC2 //_TRISA0
		#define TCON_CS_DIG()
	    
		#define TCON_SCL_LAT     LATDbits.LATD10   //_RD8
		#define TCON_SCL_TRIS    TRISDbits.TRISD10 //_TRISD8
		#define TCON_SCL_DIG()
	    
		#define TCON_SDO_LAT     LATDbits.LATD0   //_RD0
		#define TCON_SDO_TRIS    TRISDbits.TRISD0 //_TRISB1
		#define TCON_SDO_DIG()   1;
	    
		#define TCON_DC_LAT      LATBbits.LATB3   //_RB0
		#define TCON_DC_TRIS     TRISBbits.TRISB3 //_TRISB0
		#define TCON_DC_DIG()    1;
		
		#endif // #if defined (GFX_USE_DISPLAY_PANEL_TFT_G240320LTSW_118W_E)
	#endif // #if defined (DA210_DEV_BOARD)...


/*********************************************************************
* IO FOR THE BEEPER
*********************************************************************/
#if defined (GFX_PICTAIL_V2) 
	#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
		#define BEEP_TRIS_BIT   TRISBbits.TRISB4
		#define BEEP_LAT_BIT    LATBbits.LATB4
	#else
		#define BEEP_TRIS_BIT   TRISDbits.TRISD0
		#define BEEP_LAT_BIT    LATDbits.LATD0
	#endif
#endif // #if defined (GFX_PICTAIL_V2)

/*********************************************************************
* IPU OPERATION MACROS.
*********************************************************************/
/* ********************************************************************
* These defines the cache areas when using IPU of the Graphics Module. 
* The IPU operation will need two cache areas:
* - for compressed data (GFX_COMPRESSED_DATA_RAM_ADDRESS, 
*   GFX_COMPRESSED_BUFFER_SIZE)
* - for decompressed data (GFX_DECOMPRESSED_DATA_RAM_ADDRESS, 
*   GFX_DECOMPRESSED_BUFFER_SIZE)
* These two areas are not part of the memory that the Display Driver 
* uses for the viewable pixels. These two areas will exclusively be 
* used by the IPU operation to perform the decompression.
* The use of the IPU cache areas assumes that the hardware used
* is the PIC24FJ256DA210 Development Board where the EPMP CS1 is hooked
* up to SRAM and EPMP CS2 is hooked up to a parallel flash memory.
* Make sure that the buffer sizes are word aligned since IPU operates 
* only on WORD aligned addresses.
* Users can derive the size of the two areas based on the output of the
* "Graphics Resource Converter" tool used to generate the hex or C array
* of the compressed images. Please refer to the "Graphics Resource 
* Converter" Help file for details.
* If the compressed image is placed in Parallel Flash, then the
* GFX_COMPRESSED_BUFFER_SIZE is not needed since the IPU module
* can access the compressed data directly.
********************************************************************  */

#if defined (PIC24FJ256DA210_DEV_BOARD)
	#if defined (GFX_EPMP_CS1_BASE_ADDRESS)

		#define GFX_COMPRESSED_BUFFER_SIZE              (13950)
        #define GFX_DECOMPRESSED_BUFFER_SIZE            (19216)
        #define GFX_IPU_TEMP_DATA_TRANSFER_ARRAY_SIZE   (1024)

	#else
		#warning "EPMP CS1 Base Address not defined. If you are using IPU make sure that the GFX_COMPRESSED_DATA_RAM_ADDRESS & GFX_DECOMPRESSED_DATA_RAM_ADDRESS are allocated properly in internal memory."                   
    #endif

